app/controllers/articulos_controller.rb

SELECT * FROM `articulos` WHERE (revista_id = '1')
SELECT count(*) AS count_all FROM `articulos`
---
  def index
    if params[:revista_id]
      @articulos = Articulo.all(:conditions => ["revista_id = ?", params[:revista_id]]).paginate(:page => params[:page], :per_page => 10)

SELECT * FROM `articulos` WHERE (`articulos`.`id` = 272)
---
  def show
    @articulo = Articulo.find(params[:id])

SELECT * FROM `articulos` WHERE (`articulos`.`id` = 272)
---
  def edit
    @articulo = Articulo.find(params[:id])

INSERT INTO `articulos` (`autor_id`, `updated_at`, `titulo`, `contenido`, `revista_id`, `created_at`) VALUES(23, '2009-02-24 01:02:28', 'sadfsdf', 'asdf', 1, '2009-02-24 01:02:28')
---
  def create
    @articulo = Articulo.new(params[:articulo])

    respond_to do |format|
      if @articulo.save