app/controllers/revistas_controller.rb

  def index
    @revistas = Revista.paginate(:page => params[:page], :per_page => 10)
---
SELECT * FROM `revistas` LIMIT 10, 10
SELECT count(*) AS count_all FROM `revistas`

  def show
    @revista = Revista.find(params[:id])
---
SELECT * FROM `revistas` WHERE (`revistas`.`id` = 51)

  def create
    @revista = Revista.new(params[:revista])

    respond_to do |format|
      if current_user.admin? && @revista.save
---
INSERT INTO `revistas` (`updated_at`, `nombre`, `fecha_publicacion`, `editorial`, `numero`, `created_at`) VALUES('2009-02-24 01:01:57', 'adfsdf', '2009-02-24 01:01:00', 'asdfsdf', 123, '2009-02-24 01:01:57')