app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.admin = params[:user][:admin]
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `admin`, `remember_token`, `login`, `email`, `created_at`) VALUES(NULL, '8a30ad82ed6b6aed4037b4a121992cf97459ef63', '2009-02-24 01:33:01', '1e92b8c0ffb0df3cf2cdfe38ad53f879ef3d9efe', NULL, 1, NULL, 'joda', 'joda@asdfsd.com', '2009-02-24 01:33:01')

  def index
    @users = User.paginate(:per_page => 10, :page => params[:page])
---
SELECT * FROM `users` LIMIT 0, 10

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `users` WHERE `id` = 4